In [2]:
import pandas as pd

In [4]:
data = {
'Order ID': [101, 102, 103, 104, 105],
'Product': ['Product A', 'Product B', 'Product C', 'Product A', 'Product B'],
'Quantity': [10, 5, 8, 12, 6],
'Unit Price': [20.00, 25.00, 15.00, 20.00, 25.00],
'Discount': [0.05, 0.10, 0.05, 0.05, 0.10],
'Customer Name': ['John Smith', 'Jane Doe', 'Robert Johnson', 'Mary Brown', 'Susan Lee'],
'Order Date': ['2023-01-15', '2023-01-18', '2023-02-02', '2023-02-10', '2023-02-15']
}
# Create a DataFrame from the data dictionary
df = pd.DataFrame(data)

# Convert the 'Order Date' column to datetime
df['Order Date'] = pd.to_datetime(df['Order Date'])

In [5]:
df

,Order ID,Product,Quantity,Unit Price,Discount,Customer Name,Order Date
0,101,Product A,10,20.0,0.05,John Smith,2023-01-15
1,102,Product B,5,25.0,0.10,Jane Doe,2023-01-18
2,103,Product C,8,15.0,0.05,Robert Johnson,2023-02-02
3,104,Product A,12,20.0,0.05,Mary Brown,2023-02-10
4,105,Product B,6,25.0,0.10,Susan Lee,2023-02-15

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order ID       5 non-null      int64
 1   Product        5 non-null      object
 2   Quantity       5 non-null      int64
 3   Unit Price     5 non-null      float64
 4   Discount       5 non-null      float64
 5   Customer Name  5 non-null      object
 6   Order Date     5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 408.0+ bytes

In [ ]:
# - Create a new column in the DataFrame that calculates the total cost for each order (Quantity * (Unit Price - Discount)).
# - Group the data by customer and calculate the total amount spent by each customer.

In [8]:
df["total_cost"] = df["Quantity"]*(df["Unit Price"]-df["Discount"])
df.head()

,Order ID,Product,Quantity,Unit Price,Discount,Customer Name,Order Date,total_cost
0,101,Product A,10,20.0,0.05,John Smith,2023-01-15,199.5
1,102,Product B,5,25.0,0.10,Jane Doe,2023-01-18,124.5
2,103,Product C,8,15.0,0.05,Robert Johnson,2023-02-02,119.6
3,104,Product A,12,20.0,0.05,Mary Brown,2023-02-10,239.4
4,105,Product B,6,25.0,0.10,Susan Lee,2023-02-15,149.4

In [21]:
result = df.groupby("Customer Name")["total_cost"].sum().reset_index().sort_values(by=["total_cost"])
result.head()

    Customer Name  total_cost
3  Robert Johnson       119.6
0        Jane Doe       124.5
4       Susan Lee       149.4
1      John Smith       199.5
2      Mary Brown       239.4

In [17]:
#  - Function take 2 parameter: 
# 1. top,bottom
# 2. number n

# top 2 customer

def gen_result(type, number):
    if type == "top":
        return result[:number]
    elif type == "bottom":
        return result[-number:]
    else:
        print("Enter correct values")
gen_result("fist", 2)

Enter correct values

In [ ]:
''' 
select
sq.Customer_Name,
sq.total_cost
from
(
select
*,
row_number() over(order by total_cost desc) as rank_val
from result
) as sq
where sq.rank_val>=2;
'''

In [ ]:
''' 
from
where
group by
having
Select
order by
limit
'''

In [ ]:
''' 
Assume ED electronics company sales electronic items,
promotional

1.set of data
2.table to create to analyze the data
3.optimization in sales approach
4.ouput : discounts, 

'''